/**
 * LCA倍增法
 * CCPC 2025 高职专场 - L题 挑战三角形 - 反向思考
 * CCPC 2025 高职专场 - B题 爬山 - 学习分层图 + 理解Dijkstar的使用
 * ABC441 - F题 购买 - 理解并会用双向DP
 * ABC442 - E题 怪物激光 - 用数学中极角解决
 * ABC444 - B题 数位和 - 学习并使用数位DP再实现
 * ABC444 - E题 区间差 - 学习并使用线段树再实现 + 树状数组BIT
 * ABC444 - F题 切木棍 - 二分+转换为判定
 * [补题] ABC445 - D题 巧克力拼图
 * ABC445 - E题 除本身的LCM - 数论LCM与质因数分解
 * ABC445 - F题 K步环 - 矩阵快速幂
 * ABC446 - F题 图的连通性破坏 - 最小割入门
 * ABC448 - E题 拼接和整除 - 数论 + 快速幂
 * ABC449 - E题 循环节操作 - 数学规律
 * ABC450 - E题 斐波那契字符串 - 分治与区间定位
 * ABC451 - C题 林下层 - 线段树的应用
 * ABC452 - D题 子串的子序列 - 状态维护
 * ABC452 - E题 数论优化
 */